#include <stdio.h>

#define MYSCAN scanf

int main(void){
	int n, p;
	int flag;
	int i, j;
	int tmp;

	while (1){
		MYSCAN("%d", &n);
		if (n == 0){ break; }

		p = 0;
		if (n % 2 == 0){ n--; }
		for (i = n; i > 2; i -= 2){
			flag = 1;
			tmp = i / 2;
			// iテ」ツ?古ァツエツ?ヲツ閉ーテ」ツ?凝」ツ?ゥテ」ツ??」ツ?凝」ツδ?」ツつァテ」ツδε」ツつッ
			for (j = 3; j < tmp; j += 2){
				if (i % j == 0){
					flag = 0;
					break;
				}
			}

			// iテ」ツ?古ァツエツ?ヲツ閉ーテ」ツ??」ツ?」テ」ツ?淌」ツつ?
			if (flag == 1){
				// テ・ツ??」ツつ暗」ツつ?テ」ツ?、テ・ツケツエテ、ツクツ凝」ツ??」ツ?」テ」ツ?淌」ツつ嘉・ツ?コテ・ツ環?
				if (i == p - 2){
					printf("%d %d\n", i, p);
					break;
				}
				// テ」ツ?敕」ツ??」ツ?佚」ツつε」ツ?ェテ」ツ?凝」ツ?」テ」ツ?淌」ツつ嘉ィツ?ェテ・ツ按?」ツ?古・ツ??」ツ?ォテ」ツ?ェテ」ツつ?
				p = i;
			}
		}
	}
	
	return 0;
}